STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Central/STM32_WPAN/App/gmap_app.h
/* Init state */
typedef uint8_t GMAPAPP_InitState_t;
#define GMAP_APP_INIT_STATE_IDLE                 0x00
#define GMAP_APP_INIT_STATE_CAP_LINKUP           0x01
#define GMAP_APP_INIT_STATE_GMAP_LINKUP          0x02
#define GMAP_APP_INIT_STATE_SET_MEMBER_DISC      0x03
#define GMAP_APP_INIT_STATE_SET_VOLUME           0x04
#define GMAP_APP_INIT_STATE_SET_MIC_MUTE         0x05

/*Structure used for ASE information storage*/
typedef struct
{
  uint8_t               ID;
  ASE_State_t           state;
  ASE_Type_t            type;           /*Source or Sink*/
  uint8_t               allocated;
  uint8_t               num_channels;
  uint32_t              presentation_delay;
  uint32_t              controller_delay;
}APP_ASE_Info_t;

typedef struct
{
  uint16_t              acl_conn_handle;
#if (MAX_NUM_UCL_SNK_ASE_PER_LINK > 0)
  APP_ASE_Info_t        aSnkASE[MAX_NUM_UCL_SNK_ASE_PER_LINK];
#endif /* (MAX_NUM_UCL_SNK_ASE_PER_LINK > 0) */
#if (MAX_NUM_UCL_SRC_ASE_PER_LINK > 0)
  APP_ASE_Info_t        aSrcASE[MAX_NUM_UCL_SRC_ASE_PER_LINK];
#endif /* (MAX_NUM_UCL_SRC_ASE_PER_LINK > 0) */
}APP_ASEs_t;

/*Structure used for connection information strorage*/
typedef struct
{
  uint16_t                  Acl_Conn_Handle;
  uint8_t                   Peer_Address_Type;
  uint8_t                   Peer_Address[6];
  uint8_t                   Role;
  audio_profile_t           AudioProfile;
  uint8_t                   CSIPDiscovered; /*Set to 1 if Set Member has been discovered (but not yet CAP linked)*/
  uint8_t                   SIRK_type;
  uint8_t                   SIRK[16];
  uint8_t                   Rank;
  uint8_t                   Size;
  uint8_t                   ForceCompleteLinkup;
  uint8_t                   ConfirmIndicationRequired;

  BAP_Unicast_Server_Info_t UnicastServerInfo;
  APP_ASEs_t                *pASEs;

}APP_ACL_Conn_t;

typedef struct
{
  BAP_Role_t                    bap_role;

  APP_ACL_Conn_t                ACL_Conn[CFG_BLE_NUM_LINK];

  uint8_t                       audio_driver_config;

  Audio_Role_t                  audio_role_setup;

  uint16_t                      cis_src_handle[APP_MAX_NUM_CIS];

  uint8_t                       num_cis_src;

  uint16_t                      cis_snk_handle[APP_MAX_NUM_CIS];

  uint8_t                       num_cis_snk;

  uint16_t                      cis_handle[APP_MAX_NUM_CIS];

  uint8_t                       num_cis_established;

  Sampling_Freq_t               ConfiguredSinkSampleFrequency;

  Sampling_Freq_t               ConfiguredSourceSampleFrequency;

  BAP_AudioCodecController_t    AudioCodecInController;

  BAP_SupportedStandardCodec_t  aStandardCodec[1];

  APP_ASEs_t                    aASEs[CFG_BLE_NUM_LINK];

  uint8_t                       NumOutputChannels;

  uint8_t                       SetMemberDiscoveryProcActive;

  GMAPAPP_InitState_t           InitState;

  uint16_t                      OperationConnHandle;

  /* Broadcast context */
  BAP_BASE_Group_t              BaseGroup;
  BAP_BASE_Subgroup_t           BaseSubgroups[APP_MAX_SUBGROUPS];
  BAP_BASE_BIS_t                BaseBIS[APP_MAX_NUM_BIS];
  uint8_t                       BISCodecSpecificConfig[APP_MAX_NUM_BIS][MAX_BIS_CODEC_CONFIG_LEN];
  uint8_t                       SubgroupCodecSpecificConfig[APP_MAX_SUBGROUPS][APP_MAX_SUBGROUP_CODEC_CONFIG_LEN];
  uint8_t                       SubgroupMetadata[APP_MAX_SUBGROUPS][MAX_BSRC_METADATA_LEN];
  uint8_t                       RTN;
  uint16_t                      MaxTransportLatency;
  uint16_t                      CurrentBISConnHandle[APP_MAX_NUM_BIS];
  uint8_t                       CurrentNumBIS;

  uint8_t                       SinkDecimation;
  uint8_t                       SourceDecimation;
} GMAPAPP_Context_t;

typedef struct
{
  Sampling_Freq_t       freq;
  Frame_Duration_t      frame_duration;
  uint16_t              octets_per_codec_frame;
} APP_CodecConf_t;

typedef struct
{
  Sampling_Freq_t       freq;
  uint32_t              sdu_interval;
  BAP_Framing_t         framing;
  uint16_t              max_sdu;
  uint8_t               rtx_num;
  uint16_t              max_tp_latency;
  uint32_t              presentation_delay;
} APP_QoSConf_t;

typedef struct
{
  uint8_t       NumSnkASEs;
  uint8_t       NumSrcASEs;
  uint8_t       NumAudioChnlsPerSnkASE;
  uint8_t       MinSnkAudioLocations;
  uint8_t       NumAudioChnlsPerSrcASE;
  uint8_t       MinSrcAudioLocations;
  uint8_t       NumCISes;
  uint16_t      NumAudioStreams;
} APP_UnicastAudioConf_t;

/* External variables --------------------------------------------------------*/

/* Exported macros ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions ---------------------------------------------*/
void GMAPAPP_Init(void);
tBleStatus GMAPAPP_Linkup(uint16_t ConnHandle);
uint8_t GMAPAPP_StartScanning(void);
uint8_t GMAPAPP_StopScanning(void);
uint8_t GMAPAPP_CreateConnection(uint8_t *pAddress, uint8_t AddressType);
uint8_t GMAPAPP_Disconnect(void);
uint8_t GMAPAPP_RemoteVolumeUp(void);
uint8_t GMAPAPP_RemoteVolumeDown(void);
uint8_t GMAPAPP_RemoteToggleMute(void);
void GMAPAPP_LocalVolumeUp(void);
void GMAPAPP_LocalVolumeDown(void);
void GMAPAPP_LocalToggleMute(void);
uint8_t GMAPAPP_RemoteToggleMicMute(void);
uint8_t GMAPAPP_StartStream(uint8_t QOSConfIdSink, uint8_t NumChannelSink, Audio_Context_t AudioContextSink,
                            uint8_t QOSConfIdSource, uint8_t NumChannelSource, Audio_Context_t AudioContextSource,
                            uint8_t DriverConfig);
uint8_t GMAPAPP_StopStream(void);
tBleStatus GMAPAPP_StartBroadcastSource(uint8_t QOSConfId);
tBleStatus GMAPAPP_StopBroadcastSource(void);
void GMAPAPP_AclConnected(uint16_t Conn_Handle,uint8_t Peer_Address_Type,uint8_t Peer_Address[6],uint8_t role);
void GMAPAPP_CISConnected(uint16_t Conn_Handle);
void GMAPAPP_LinkDisconnected(uint16_t Conn_Handle,uint8_t Reason);
void GMAPAPP_ConfirmIndicationRequired(uint16_t Conn_Handle);
void GMAPAPP_BondLost(uint16_t Conn_Handle);
uint8_t APP_GetNumActiveACLConnections(void);
#ifdef __cplusplus
}
#endif
#endif /* __GMAP_APP_H */

